import random

sentence = ["Мур! Кожна помилка — це як подряпина на досвіді. Більше подряпин — мудріший програміст!","Не здавайся, хвостиком клянусь — навіть найзаплутаніший код можна розчесати, як клубочок!","Hello, World! — з цього починається кожна велика історія. І твоя теж!","Пиши код, відпочивай, обіймай свого внутрішнього кота-програміста!","Програмування — як полювання на мишку. Терпіння, спостереження — і трохи кмітливості!","Ти не один. У цьому світі кодять ще мільйони лапок","Коли здається, що нічого не працює — просто подрімай. Кодик завжди дрімає між рядками!","Якщо код працює — не чіпай. Якщо не працює — зроби вигляд, що це фіча!","Найкращий debug — це коли подивився на код і такий: 'А чому воно взагалі працювало?'","Заплутаний код? Просто подумай як кіт: спочатку все переплутай, а потім повільно розплутуй, мур-мур."]
cat =["(=^･ω･^=)","ᓚ₍ ^. .^₎","ฅ^•ﻌ•^ฅ","₍^. .^₎⟆","≽^•⩊•^≼","/ᐠ˵- ⩊ -˵マ"]
whatSentence = random.choice(sentence)
whatCat = random.choice(cat)
space = ""
howManySpace = len(whatSentence) // 2
for i in range(howManySpace):
    space+=" "
print(space+whatCat)
print("Кодик каже: "+ whatSentence)
print("Ps: якщо хочеш більше мотивуючих фразочек від кодика переходь в телеграм бота: @Kodik_ProgOs_bot, тим більш там постіно виходять оновленя!/ᐠ. .ᐟ\⟆")